In [1]:
#Introduccion a Dataframe

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
filas = ['ventas1', 'ventas2', 'ventas3']

In [5]:
columnas = ['zonaA', 'zonaB', 'zonaC']

In [6]:
datos = [[123,421,256], [235,541,257], [120,421,213]]

In [7]:
dataframe = pd.DataFrame(datos, filas, columnas)

In [8]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    235    541    257
ventas3    120    421    213

In [11]:
dataframe.loc[['ventas1', 'ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    235    541    257

In [14]:
dataframe[['zonaA']]

         zonaA
ventas1    123
ventas2    235
ventas3    120

In [20]:
dataframe.loc['ventas1']['zonaA']

123

In [21]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    235    541    257
ventas3    120    421    213

In [22]:
dataframe['TodaslasZonas'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']

In [23]:
dataframe['TodaslasZonas']

ventas1     800
ventas2    1033
ventas3     754
Name: TodaslasZonas, dtype: int64

In [24]:
dataframe

         zonaA  zonaB  zonaC  TodaslasZonas
ventas1    123    421    256            800
ventas2    235    541    257           1033
ventas3    120    421    213            754

In [25]:
dataframe.drop('TodaslasZonas', axis=1)

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    235    541    257
ventas3    120    421    213

In [26]:
dataframe

         zonaA  zonaB  zonaC  TodaslasZonas
ventas1    123    421    256            800
ventas2    235    541    257           1033
ventas3    120    421    213            754

In [27]:
dataframe.drop('TodaslasZonas', axis=1, inplace=True)

In [28]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    235    541    257
ventas3    120    421    213

In [29]:
#eliminar una columna
dataframe.drop('ventas3')

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    235    541    257

In [31]:
dataframe.drop('ventas3', inplace=True)

In [32]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    235    541    257